## Continuação do exercicio da aula anterior
- foi adicionado a rede mais um Roteador com um Hub e 3 Computadores ligados a ele
  - Computadores:
    - G | ip:192.168.0.28/29| mascara: 255.255.255.248| GW: 192.168.0.25
    - H | ip:192.168.0.26/29| mascara: 255.255.255.248| GW: 192.168.0.25
    - I  | ip:192.168.0.27/29| mascara: 255.255.255.248| GW: 192.168.0.25
  - Roteador 3:
    - ligado ao hub3 peça FastEthernet 0/0 com endereço ip:192.168.0.25
    - ligado ao roteador 2 peça FastEthernet 1/0 com endereço ip:192.168.0.33/30
    - ligado ao roteador 1 peça FastEthernet 1/1 com endereço ip:192.168.0.22/30
  - Roteador 2:
    - ligado ao roteador 3 peça FastEthernet 1/0 com endereço ip:192.168.0.34/30
  - Roteador 1:
    - ligado ao roteador 3 peça FastEthernet 1/1 com endereço ip:192.168.0.21/30

<div align="center">
  
  <img width="1205" height="688" alt="image" src="https://github.com/user-attachments/assets/7e34cad8-1700-4aa0-861b-6047ed156fc6" />
  
</div>
  
# CONFIGURAÇÃO DO IP NO ROTEADOR 
- abrir os comando do roteador e usar os comandos:
```
  Router>en
  Router#
  Router#sh run // utilizado para verificar as interfaces dele e quais os ip adicionado deles e quais as rotas já cadastradas
  Router#conf t
  Enter configuration commands, one per line.  End with CNTL/Z.
  Router(config)#int f 0/0 //esrever qual a FastEthernet será configuradora
  Router(config-if)#ip address 192.168.0.1 255.255.255.248 //ip seguido da mascara
  Router(config-if)#no shut
  Router(config-if)#exit
  Router(config)#exit
  Router#
  Router#wr
```
- para ligar 3 roteadores entre si é necessário adicionar um modulo a cada roteador, o usado em sala foi NM2FE2W que possibilita mais duas conexões via FastEthernet

  
# CONFIGURAÇÕES DE ROTAS
- **ROTA A ➜ ROTA B**:  Nas configurações do roteador A usar os comando
```
  Router>
  Router>en
  Router#
  Router#conf t
  Router (config)#
  Router(config)#ip route "ip da rede B"  "Mascara do ip da rede B" "Ip do roteador B"
  Router(config)#exit
  Router#wr
```
  
- ROTA 1 ➜ ROTA 3: Router(config)#ip route 192.168.0.24 255.255.255.248 192.168.0.22
- ROTA 3 ➜ ROTA 1: Router(config)#ip route 192.168.0.8 255.255.255.248 192.168.0.21
- ROTA 2 ➜ ROTA 3: Router(config)#ip route 192.168.0.24 255.255.255.248 192.168.0.33
- ROTA 3 ➜ ROTA 2: Router(config)#ip route 192.168.0.0 255.255.255.248 192.168.0.34


## ANOTAÇÕES
- saber quais caboas usar para ligar computador, hub, roteador,...., ➜ pinagem e cores do cabo par trançado(BL,L,BV,V)
- cabo crossover ➜ roteador -- roteador, entre dispositivos pensantes
- GW = sempre tem que ser vizinho ➜ ligação entre roteador e hub na configuração
